Закупки/src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияТоваров</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Закупки/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Закупки/src/Enums/СтатусЗаказа/СтатусЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаказа</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Закупки/src/Enums/СтатусЗаявки/СтатусЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаявки</name>
  <enumValues>
    <name>НеВЗаказе</name>
  </enumValues>
  <enumValues>
    <name>ВНеСогласованомЗаказе</name>
  </enumValues>
  <enumValues>
    <name>ВСогласованномЗаказе</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
</mdclass:Enum>

Закупки/src/Documents/ВнутренниеЗаявки/ВнутренниеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутренниеЗаявки</name>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияТоваров</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадоПриобрести</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаявки</types>
    </type>
  </attributes>
</mdclass:Document>

Закупки/src/Documents/Заказы/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтотОбъект.СуммаЗаказа = ЭтотОбъект.Товары.Итог("Сумма");
	
	ТаблТовары = ЭтотОбъект.Товары.Выгрузить();
	
	Если ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерДокумента) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерДокумента).ПолучитьОбъект();
				ТекЗаявка.Статус = Перечисления.СтатусЗаявки.ВНеСогласованомЗаказе;
				ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Согласован или ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Оплачен Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерДокумента) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерДокумента).ПолучитьОбъект();
				ТекЗаявка.Статус = Перечисления.СтатусЗаявки.ВСогласованномЗаказе;
				ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	
	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Получен Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерДокумента) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерДокумента).ПолучитьОбъект();
				ТекЗаявка.Статус = Перечисления.СтатусЗаявки.Получен;
				ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Закрыт Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерДокумента) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерДокумента).ПолучитьОбъект();
				ТекЗаявка.Удалить();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Закрыт Тогда
		Движения.ОстаткиТоваров.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
		КонецЦикла;
	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
//		НаписатьПисьмо();
	КонецЕсли;
КонецПроцедуры



Процедура НаписатьПисьмо()
	ПрофильПодключения = Новый ИнтернетПочтовыйПрофиль;
	ПрофильПодключения.АдресСервераSMTP ="smtp адрес сервера";
 
	ПрофильПодключения.ИспользоватьSSLSMTP=Истина;
 
	ПрофильПодключения.ПортSMTP = 465;
 
	ПрофильПодключения.ПользовательSMTP = "АдресКомпании";
	ПрофильПодключения.ПарольSMTP = "Пароль";
 

	Почта = Новый ИнтернетПочта;
 

	Попытка
		Почта.Подключиться(ПрофильПодключения);
	Исключение
		Сообщить("Не удалось подключиться к серверу ""smtp адрес сервера""");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
 
	Тело="Добрый день!
	|Вас приветствует компания ""Название Компании""
	|Хотим сделать заказ!    
	|
	|";

	Письмо = Новый ИнтернетПочтовоеСообщение;
 
	Письмо.Тексты.Добавить(Тело);
	
	Выборка = Товары.Выгрузить();
	
	Для каждого стр из Выборка Цикл
		Письмо.Тексты.Добавить(стр.Номенклатура.Наименование + " в количестве " + стр.ТекущееКоличество + "шт.");
	КонецЦикла;
	
	
	Письмо.Тема = "Хотим сделать у вас заказ";
	Письмо.Отправитель = "Адрес вашей Компании";
	Письмо.ИмяОтправителя = "Название вашей Компании";
	Письмо.Получатели.Добавить(ЭтотОбъект.Поставщик.Email);


    Попытка
		Почта.Послать(Письмо);
    Исключение
        Сообщить("Не удалось отправить письмо ");
        Сообщить(ОписаниеОшибки());
	КонецПопытки;	

	Почта.Отключиться();

КонецПроцедуры


Процедура ПередУдалением(Отказ)
	Если ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
		Для каждого СтрТовары из Товары Цикл
			Если ЗначениеЗаполнено(СтрТовары.НомерДокумента) Тогда
				ТекТовар = Документы.ВнутренниеЗаявки.НайтиПоНомеру(СтрТовары.НомерДокумента).ПолучитьОбъект();
				ТекТовар.Статус = Перечисления.СтатусЗаявки.НеВЗаказе;
				ТекТовар.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
